run/hartmann_copy/constant/transportPropertiesMHD
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rho             rho [1 -3 0 0 0 0 0] 1;

nu              nu [0 2 -1 0 0 0 0] 1;

mu              mu [1 1 -2 0 0 -2 0] 1;

sigma           sigma [-1 -3 3 0 0 2 0] 1;

// ************************************************************************* //
